Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Consult the documentation that came with the module for subscription information.
es_es: Consulte la documentación del módulo para averiguar qué tiene que hacer para suscribirse a su lista de correo.

source: NAME needn't be the name of a subroutine; it can be a scalar variable containing a code reference or a block that evaluates to a code reference.
es_es: NOMBRE no necesita ser el nombre de una subrutina; puede ser una variable escalar que contenga una referencia a un código o un bloque que evalúa a una referencia de código.

source: On some systems (in general, DOS- and Windows-based systems) binmode() is necessary when you're not working with a text file.
es_es: En algunos sistemas (en general, sistemas basados en DOS y Windows) binmode() es necesario cuando no esté trabajando con un archivo de texto.

source: A negative subscript retrieves its value from the end.
es_es: Un subíndice negativo devuelve un valor a partir del final.

source: On systems that don't support symbolic links, raises an exception.
es_es: En los sistemas que no admiten los enlaces simbólicos, produce una excepción.

source: OPERATOR PRECEDENCE = = perl.plover.com
es_es: PRIORIDAD OPERADORES = = perl.plover.com

source: %G like %g, but with an upper-case "E" (if applicable)
es_es: %G como %g, pero con una letra letra "E" mayúscula (si es aplicable)

source: As this could cause problems when C<goto> jumps were involved, this change has been backed out.
es_es: Ya que esto podría causar problemas cuando intervenían saltos C<goto>, este cambio ha sido deshecho.

source: @pats = qw{
es_es: @patrones = qw{

source: It's a zero-width pattern similar to C<(*SKIP)>, except that when backtracked into on failure it causes the match to fail outright.
es_es: Es un patrón de ancho cero similar a C<(*SKIP)>, excepto que cuando ocurre la vuelta atrás a causa de un fallo hace que la coincidencia falle completamente.

source: Scalars, arrays and hashes are documented more fully in L<perldata>.
es_es: Encontrará información detallada sobre los escalares, arrays y hashes en L<perldata>.

source: You don't just have to match on fixed strings.
es_es: No tiene que limitarse a detectar coincidencias en cadenas fijas.

source: In scalar context, returns the total number of elements so generated.
es_es: En contexto escalar, devuelve el número total de elementos generados.

source: Besides the normal array index looping, C<for> can lend itself to many other interesting applications.
es_es: Además de recorrer los índices de los arrays, C<for> puede prestarse a otras interesantes aplicaciones.

source: // die "Can't open pipeline to lpr: $!";
es_es: // die "No puedo entubar hacia lpr: $!";

source: "Hello, world"
es_es: "Hola a todos"

source: As a beginning Perl programmer, your most common use of OO Perl will be in using third-party modules, which are documented below.
es_es: La aplicación que suelen hacer los programadores principiantes de la programación orientada a objetos en Perl es la utilización de módulos de terceros, que se describe a continuación.

source: The following code will build up an ASCII string saying C<'PerlPerlPerl'>.
es_es: El código siguiente construirá una cadena ASCII diciendo C<'PerlPerlPerl'>.

source: The version control system used for the development of the perl interpreter has been switched from Perforce to git.
es_es: El sistema de control de versiones usado para el desarrollo del intérprete perl se ha cambiado de Perforce a git.

source: my ($coderef, $filename) = @_; # $coderef is \&my_sub
es_es: my ($coderef, $archivo) = @_; # $coderef is \&mi_sub

source: Some functions appear in more than one place.
es_es: Algunas funciones aparecen en más de un lugar.

source: In list context, this sorts the LIST and returns the sorted list value.
es_es: En contexto lista, ordena la LISTA y devuelve los valores de la lista ordenados.

source: For example, C</\w+(?=\t)/> matches a word followed by a tab, without including the tab in C<$&>.
es_es: Por ejemplo, C</\w+(?=\t)/> coincide con una palabra seguida por un tabulador, sin incluir el tabulador en C<$&>.

source: Choose mnemonic identifiers.
es_es: Elija identificadores mnemónicos.

source: # a bunch of anything
es_es: # un montón de nada

source: Consider the case where some patterns want to be case-sensitive and some do not: The case-insensitive ones merely need to include C<(?i)> at the front of the pattern.
es_es: Considere el caso de que algunos patrones quieren ser sensibles a las mayúsculas y otros no: para el caso de los patrones insensibles sólo necesita incluir C<(?i)> por delante del patrón.

source: s/^\s*(.*?)\s*$/$1/; # trim whitespace in $_, expensively
es_es: s/^\s*(.*?)\s*$/$1/; # recorta el espacio en blanco en $_, de forma onerosa

source: perllexwarn Perl warnings and their control
es_es: perllexwarn Advertencias y control de advertencias

source: The term "native" does not mean quite as much when we talk about native integers, as it does when native floating point numbers are involved.
es_es: En el caso de los enteros nativos, el término "nativo" no tiene las mismas implicaciones que para los números de punto flotante nativos.

source: =item print FILEHANDLE LIST X<print>
es_es: =item print IDENTIFICADOR_ARCHIVO LISTA X<print>

source: If you want to cross-post to alt.sources, please make sure it follows their posting standards, including setting the Followup-To header line to NOT include alt.sources; see their FAQ ( http://www.faqs.org/faqs/alt-sources-intro/ ) for details.
es_es: Si desea publicarlo además en alt.sources, asegúrese de cumplir sus normas de publicación, como la de establecer una línea de encabezado de seguimiento que NO incluya alt.sources; consulte la sección de preguntas más frecuentes ( http://www.faqs.org/faqs/alt-sources-intro/ ) para obtener información detallada.

source: File::Find could become confused when navigating to a relative directory whose name collided with a logical name.
es_es: File::Find podría confundirse cuando se navega a un directorio de forma relativa cuyo nombre coincide con un nombre lógico.

source: It's safer because if code gets added between the inner and outer loops later on, the new code won't be accidentally executed.
es_es: Es más seguro porque si se añade nuevo código entre los bucles interno y externo, ese nuevo código no será ejecutado accidentalmente.

source: Binary "le" returns true if the left argument is stringwise less than or equal to the right argument.
es_es: Binario "le" devuelve verdadero si el argumento de la izquierda es alfanuméricamente menor o igual que el argumento de la derecha.

source: # do something here
es_es: # hacer algo aquí

source: For example, you stick 10,000 things in a hash, but evaluating %HASH in scalar context reveals C<"1/16">, which means only one out of sixteen buckets has been touched, and presumably contains all 10,000 of your items.
es_es: Por ejemplo, supóngase que se insertan 10.000 valores en un hash, pero al evaluar el %HASH en contexto escalar nos devuelve C<"1/16">, lo cual significa que sólo una de cada dieciséis unidades ha sido tocada, y que probablemente contiene los 10.000 elementos.

source: The behavior of kill when a I<PROCESS> number is zero or negative depends on the operating system.
es_es: El comportamiento de kill cuando el I<PROCESO> es el número cero o negativo depende del sistema operativo.

source: Any letters between C<?> and C<:> act as flags modifiers as with C<(?adluimsx-imsx)>.
es_es: Cualquier letra entre C<?> y C<:> actúa como modificadores de banderas con C<(?adluimsx-imsx)>.

source: Note the use of $ instead of \ in the last example.
es_es: Note el uso de $ en lugar de \ en el último ejemplo.

source: perltw Perl for Traditional Chinese (in Big5)
es_es: perltw Perl para chino tradicional (en Big5)

source: Names that do not start with a letter, underscore, digit or a caret (i.e. a control character) are limited to one character, e.g., C<$%> or C<$$>.
es_es: Los nombres que no empiecen ni por letra, ni subrayado, ni dígito, ni acento circunflejo (es decir, un carácter de control) están limitados a un solo carácter, como por ejemplo C<$%> o C<$$>.

source: The following are recognized:
es_es: Lo siguiente es reconocido como correcto:

source: If the expression is omitted, one-match searches (C<?pattern?>) are reset to match again.
es_es: Si la expresión se omite, las búsquedas de una sola coincidencia (C<?pattern?>) son reinicializadas para que vuelvan a hacer el trabajo de coincidencia.

source: Otherwise it's a list operator or unary operator, and precedence does matter.
es_es: De lo contrario es un operador de lista u operador unario, y la precedencia sí importa.

source: The character following C<\c> is mapped to some other character as shown in the table:
es_es: El carácter que siga a C<\c> es mapeado a algún otro carácter, tal como se muestra en esta tabla:

source: or equivalently,
es_es: o equivalentemente,

source: Check L<perlop> for more detail.)
es_es: Consulte L<perlop> para obtener más información)

source: When called in list context, returns a 2-element list consisting of the key and value for the next element of a hash, or the index and value for the next element of an array, so that you can iterate over it.
es_es: Cuando se le llama en contexto lista, devuelve una lista de dos elementos consistentes en la clave y el valor del siguiente elementos del hash, o el índice y valor del siguiente elemento del array, así que de esta manera puede iterar por el.

source: Returns false if the context is looking for a scalar.
es_es: Devuelve falso si el contexto está buscando por un escalar.

source: To break the loop, the following match after a zero-length match is prohibited to have a length of zero.
es_es: Para romper el bucle, la siguiente coincidencia después de una coincidencia de longitud cero se prohíbe que tenga una longitud cero.

source: if (EXPR) BLOCK elsif (EXPR) BLOCK ... else BLOCK
es_es: if (EXPR) BLOQUE elsif (EXPR) BLOQUE ... else BLOQUE

source: See also L</grep> for an array composed of those items of the original list for which the BLOCK or EXPR evaluates to true.
es_es: Vea también L</grep> para un array compuesto por los elementos de la lista original en que el BLOQUE o EXPR se evalúa como verdadero.

source: for (@hash{keys %hash}) { s/foo/bar/g } # same
es_es: for (@hash{keys %hash}) { s/foo/bar/g } # lo mismo

source: If your system has a strange pointer size--meaning a pointer is neither as big as an int nor as big as a long--it may not be possible to pack or unpack pointers in big- or little-endian byte order.
es_es: Si su sistema tiene un tamaño de puntero extraño -lo que significa que un puntero no es ni tan grande como un int, ni tan grande como un long- quizás no pueda ser posible empaquetar o desempaquetar punteros en orden big-endian o little-endian.

source: The C<< <> >> operator is most often seen in a C<while> loop:
es_es: El operador C<< <> >> se suele utilizar en un bucle C<while>:

source: All systems use the virtual C<"\n"> to represent a line terminator, called a "newline".
es_es: Todos los sistemas usan el carácter virtual C<"\n"> para representar un terminador de línea, llamado un "nueva línea".

source: %by_name = reverse %by_address; # Invert the hash
es_es: %por_nombre = reverse %por_direccion; # Invierte el hash

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at F<http://bugs.perl.org/>.
es_es: Si encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y en la base de datos de errores de perl en F<http://bugs.perl.org/>.

source: Perl has now support for the C<CLONE_SKIP> special subroutine.
es_es: Perl ahora tiene soporte para la subrutina especial C<CLONE_SKIP>.

source: shutdown(Wtr, 0); # no more reading for writer
es_es: shutdown(Wtr, 0); # no más lecturas para el escritor

source: It is written in the POD format (see pod/perlpod.pod) which is specially designed to be readable as is.
es_es: Está escrito en formato POD (ver pod/perlpod.pod) que está específicamente diseñado para ser legible de forma sencilla.

source: You might like to use C<do> to read in a program configuration file.
es_es: Puede usar C<do> para leer en un programa un archivo de configuración.

source: On systems that support futimes(2), you may pass filehandles among the files.
es_es: En sistemas que soporten futimes(2), puede pasar identificadores de archivo entre los archivos.

source: # Stat returns list value.
es_es: # stat devuelve una lista.

source: C<u>, where it is equivalent to 1 (or 45, which here is equivalent).
es_es: C<u>, donde es equivalente a 1 (o 45, que aquí es equivalente).

source: A missing pattern always matches.
es_es: Un patrón no presente siempre coincide.

source: perlfaq Perl frequently asked questions
es_es: perlfaq Preguntas más frecuentes

source: A separate DTrace is now build for miniperl, which means that perl can be compiled with -Dusedtrace on Solaris again.
es_es: Ahora se construye un DTrace aparte, para miniperl. Esto quiere decir que perl puede ser, de nuevo, compilado con -Dusedtrace en Solaris.

source: =item I<Programming Perl> (the "Camel Book"):
es_es: =item I<Programming Perl> (el "Libro del Camello"):

source: printf '<%.4g>', 100.01; # prints "<100>"
es_es: printf '<%.4g>', 100.01; # imprime "<100>"

source: push @nums, ( /=(\d+)/ ? $1 : undef );
es_es: push @numeros, ( /=(\d+)/ ? $1 : undef );

source: When inside of a nested pattern, such as recursion, or in a subpattern dynamically generated via C<(??{})>, only the innermost pattern is ended immediately.
es_es: Cuando, dentro de un patrón anidado, tales como una recursión, o en un sub-patrón generado de forma dinámica a través de C<(??{})>, sólo el patrón más interno es terminado inmediatamente.

source: A user could specify a filename of F<"rsh cat file |">, or you could change certain filenames as needed:
es_es: Un usuario podría especificar un nombre de archivo como F<"rsh cat archivo |">, o podría cambiar ciertos nombres de archivo, según lo que necesite:

source: C<setlogmask()> now behaves like its C counterpart.
es_es: C<setlogmask()> ahora se comporta igual que su homólogo en C.

source: Subpatterns are numbered based on the left to right order of their opening parenthesis.
es_es: Los subpatrones son numerados basados en el orden, de izquierda a derecha, de su paréntesis de apertura.

source: $utf8 =~ /$byte|X}/i; # failed in 5.10.0
es_es: $utf8 =~ /$byte|X}/i; # fallaba en 5.10.0

source: Search::Dict: allow transforming lines before comparing
es_es: Search::Dict: permite transformar líneas antes de compararlas

source: =head1 NAME X<operator>
es_es: =head1 NOMBRE X<operator> X<operador>

source: If SIGNAL is zero, no signal is sent to the process, but C<kill> checks whether it's I<possible> to send a signal to it (that means, to be brief, that the process is owned by the same user, or we are the super-user).
es_es: Si la SEÑAL es cero, no se envía señal al proceso, pero C<kill> comprueba si I<posible> enviar una señal a la misma (lo que significa, para ser breve, que el proceso es propiedad del mismo usuario, o somos el super-usuario).

source: This aspect of C<each> is considered highly experimental.
es_es: Este aspecto de C<each> es considerado altamente experimental.

source: For how many bytes a string encoded as UTF-8 would take up, use C<length(Encode::encode_utf8(EXPR))> (you'll have to C<use Encode> first).
es_es: Para saber la cantidad de bytes que una cadena codificada como UTF-8 ocupa, utilice C<length(Encode::encode_utf8(EXPR))> (tendrá que poner C<use Encode> primero).

source: If there was no error, C<$@> is guaranteed to be the empty string.
es_es: Si no hay errores, se garantiza que C<$@> será una cadena vacía.

source: Use C<perldoc E<lt>nameE<gt>> to get information on any of the utilities described in this document.
es_es: Para obtener información sobre cualquiera de las utilidades descritas en este documento, use C<perldoc E<lt>nombreE<gt>>.

source: @folks[0, -1] = @folks[-1, 0];
es_es: @gente[0, -1] = @gente[-1, 0];

source: Likewise,
es_es: Del mismo modo,

source: If any of the file tests (or either the C<stat> or C<lstat> operator) is given the special filehandle consisting of a solitary underline, then the stat structure of the previous file test (or stat operator) is used, saving a system call.
es_es: Si a cualquiera de los test de archivo (o los operadores C<stat> o C<lstat>) se les da el identificador de archivo especial consistente en un solitario guión bajo, entonces se usa la estructura stat del archivo del test anterior (u operador stat), ahorrando una llamada del sistema.

source: # $mon=9, $mday=18 gives "Oct 18"
es_es: # $mes=9, $mdia=18 da "Oct 18"

source: my @sorted = sort @animals;
es_es: my @ordenados = sort @animales;

source: (See examples above under L<Terms and List Operators (Leftward)>.) X<+>
es_es: (Ver ejemplos anteriores en L<Términos y Operadores de listas (por la izquierda)>) X<+>

source: However, many of the guidelines presented in this document can be extrapolated and applied successfully to a module's internals.
es_es: Sin embargo, muchas de las directrices que se presentan en este documento puede ser extrapoladas y aplicadas con éxito a un módulo de uso particular.

source: NaN is not "<", "==", ">", "<=" or ">=" anything (even NaN), so those 5 return false.
es_es: NaN no es "<", "==", ">", "<=" o ">=" ni cualquier otra cosa (incluso NaN), así que estos 5 devuelven falso.

source: If you are looking for a "bar" that isn't preceded by a "foo", C</(?!foo)bar/> will not do what you want.
es_es: Si está buscando por un "bar" que no esté precedido por un "foo", C</(?!foo)bar/> no hará lo que espera.

source: Bit::Vector manipulate bit vectors fast (uses C)
es_es: Bit::Vector manipula vectores bit rápidamente (usa C)

source: =head2 Logical And X<operator, logical, and> X<and>
es_es: =head2 And lógico X<operator, logical, and> X<and> X<operador, lógico, and>

source: Perl language for MPE
es_es: Perl lenguaje para el MPE

source: If you evaluate a hash in scalar context, it returns false if the hash is empty.
es_es: Si se evalúa un hash en contexto escalar, devuelve falso si el hash está vacío.

source: The Perl community is geared toward supporting the most recent releases, so you'll have an easier time finding help for those.
es_es: La comunidad Perl tiende a ofrecer soporte para las versiones más recientes, por lo que le costará menos encontrar ayuda para estas versiones.

source: Binary "=~" binds a scalar expression to a pattern match.
es_es: Binario "=~" une una expresión escalar a un patrón de coincidencia.

source: See also the B<-u> command-line switch in L<perlrun>, which does the same thing.
es_es: Ver también la opción de línea de comando B<-u> en L<perlrun>, que hace lo mismo.

source: use bigint; # easy interface to Math::BigInt
es_es: use bigint; # interfaz sencillo para Math::BigInt

source: if ( /\b(foo)\s+(\w+)/i ) {
es_es: if ( /\b(come)\s+(\w+)/i ) {

source: =item Bitwise operators
es_es: =item Operadores bit a bit

source: Note that C<tr> does B<not> do regular expression character classes such as C<\d> or C<\pL>.
es_es: Tenga en cuenta que C<tr> B<no> usa expresiones regulares de clases de caracteres, tales como C<\d> o C<\pL>.

source: This proxy constant subroutine is automatically upgraded to a real typeglob with subroutine if necessary.
es_es: Este cacheo de la subrutina constante se actualiza automáticamente a un typeglob real con subrutina, si es necesario.

source: Program | Statement | = / \ / \ $a + / \ $b $c
es_es: Programa | Instrucción | = / \ / \ $a + / \ $b $c

source: See L<perlrecharclass/Bracketed Character Classes> for details.
es_es: Vea L<perlrecharclass/Clases carácter encorchetadas> para más detalles.

source: Not useful.
es_es: Nada útil.

source: Check L<perlport> and either the rename(2) manpage or equivalent system documentation for details.
es_es: Compruebe L<perlport> y, o bien la página de manual de rename(2) o documentación equivalente del sistema para más detalles.

source: my %fruit_color = ("apple", "red", "banana", "yellow");
es_es: my %color_fruta = ("manzana", "rojo", "plátano", "amarillo");

source: \l lowercase next character only
es_es: \l siguiente car. en minúscula

source: =item <<EOF X<here-doc> X<heredoc> X<here-document> X<<< << >>>
es_es: =item <<EOF X<here-doc> X<heredoc> X<here-document> X<<< << >>> X<documento incrustado>

source: =item printf FILEHANDLE FORMAT, LIST X<printf>
es_es: =item printf IDENTIFICADOR_ARCHIVO FORMATO, LISTA X<printf>

source: printf "<%.*2$x>", 1, 6; # INVALID, but in future will print "<000001>"
es_es: printf "<%.*2$x>", 1, 6; # INVÁLIDO, pero en el futuro imprimirá "<000001>"

source: Like C<ptar>, it comes with C<Archive::Tar>.
es_es: Como C<ptar>, viene con C<Archive::Tar>.

source: =head2 Weak references are cheaper
es_es: =head2 Referencias débiles son ahora más livianas

source: X<-X> X<filetest> X<operator, filetest>
es_es: X<-X> X<filetest> X<operator, filetest> X<operador, test archivo>

source: [This function has been largely superseded by the C<untie> function.]
es_es: [Esta función ha sido largamente supeditada por la función C<untie>].

source: Together with undefining C<$/> to input entire files as one record, this can be quite fast, often faster than specialized programs like fgrep(1).
es_es: Junto con la indefinición de C<$/> para la entrada de archivos completos como un único registro, esto puede ser bastante rápido, a menudo más rápido que los programas especializados como fgrep(1).

source: In general, binmode() should be called after open() but before any I/O is done on the filehandle.
es_es: En general, binmode() debe ser llamada después de open() pero antes de que cualquier I/O se realice sobre el identificador de archivo.

source: This is so that you can write loops like:
es_es: De esa manera puede escribir bucles como este:

source: No space before the semicolon.
es_es: Sin espacio antes de punto y coma.

source: Likewise, hashes included as parts of other lists (including parameters lists and return lists from functions) always flatten out into key/value pairs.
es_es: Del mismo modo, los hashes incluidos como parte de otras listas (incluidas las listas de parámetros y listas de retorno de funciones) siempre se extienden en pares clave / valor.

source: =item prototype FUNCTION X<prototype>
es_es: =item prototype FUNCIÓN X<prototype> X<prototipo>

source: The results are what the C language system call C<tolower()> returns.
es_es: Los resultados son los que devuelve la llamada del sistema en lenguaje C C<tolower()>.

source: \pP [3] Match P, named property.
es_es: \pP [3] Coincide con P, una propiedad nominal.

source: Replace C<5.8.6> with your respective version of Perl.
es_es: Reemplace C<5.8.6> con su respectiva versión de Perl.

source: It can be useful but it may be a memory hog.
es_es: Puede resultar útil, pero esta operación consume mucha memoria.

source: Starting in Perl 5.14, a C<"^"> (caret or circumflex accent) immediately after the C<"?"> is a shorthand equivalent to C<d-imsx>.
es_es: A partir de Perl 5.14, un C<"^"> (acento circunflejo) inmediatamente después de un C<"?"> es una abreviatura equivalente de C<d-imsx>.

source: Queries the option named OPTNAME associated with SOCKET at a given LEVEL.
es_es: Consulta la opción con nombre OPCIÓN asociada con el SOCKET en un determinado NIVEL.

source: The right argument is a search pattern, substitution, or transliteration.
es_es: El argumento de la derecha es un patrón de búsqueda, sustitución o transliteración.
